app/controllers/clientes_controller.rb

SELECT * FROM "clientes" ORDER BY nome, bloco, apartamento LIMIT 8 OFFSET 0
SELECT count(*) AS count_all FROM "clientes"
---
  def index
    @clientes = Cliente.paginate(:all, :order => "nome, bloco, apartamento", :page => params[:page])

SELECT * FROM "clientes" ORDER BY bloco desc, apartamento, nome LIMIT 8 OFFSET 0
SELECT count(*) AS count_all FROM "clientes"
---
  def por_ordenacao
    @clientes = Cliente.paginate(:all, :order => params[:ordem], :page => params[:page])

SELECT * FROM "clientes" WHERE ("clientes"."id" = 12)
---
  def show
    @cliente = Cliente.find(params[:id])

SELECT * FROM "clientes" WHERE ("clientes".id_responsavel = 12)
---
  def edit
    @cliente = Cliente.find(params[:id])