app/controllers/lancamento_compras_controller.rb

INSERT INTO "lancamentos" ("updated_at", "numero_nota_fiscal", "data_de_vencimento", "type", "valor", "tipo_credito_debito", "fornecedor", "forma_de_pagamento_id", "centro_de_custo_id", "descricao", "data", "created_at") VALUES('2009-08-23 22:56:12', '3342423', '2009-09-05 03:00:00', 'LancamentoCompra', 224.0, 'D', 'Sams Club', 4, 1, '', '2009-08-23 03:00:00', '2009-08-23 22:56:12')
---
  def create
    @lancamento_compra = LancamentoCompra.new(params[:lancamento_compra])

    respond_to do |format|
      if @lancamento_compra.save

DELETE FROM "lancamentos" WHERE "id" = 3
---
  def destroy
    @lancamento_compra = LancamentoCompra.find(params[:id])
    @lancamento_compra.destroy