app/controllers/loja_controller.rb

SELECT * FROM "produtos" WHERE (descricao like 'bet%') ORDER BY descricao
---
  def autocomplete_novo_item
    @produtos = Produto.find(:all, :conditions => "descricao like '#{params[:compras][:novo_item]}%'", :order => "descricao")

SELECT * FROM "produtos" WHERE ("produtos"."descricao" = 'Beterraba') LIMIT 1
SELECT "produtos".id FROM "produtos" WHERE ("produtos"."codigo_barras" = '1' AND "produtos".id <> 4) LIMIT 1
UPDATE "produtos" SET "updated_at" = '2009-07-07 04:24:38' WHERE "id" = 4
---
  def adiciona_produto_lista_compras
    flash[:notice] = nil
    produto = Produto.find_by_descricao(params[:descricao_item]) if params[:descricao_item]
    produto = Produto.find_by_codigo_barras(params[:codigo_barras_item]) if params[:codigo_barras_item]
    quantidade = BigDecimal.new(params[:quantidade_item])
    modo_edicao = params[:modo_edicao]
    begin
      if (modo_edicao != 'true') then
        @pedido.adiciona_produto(produto, quantidade)
      else
        item = @pedido.obtem_item_produto(produto)
        if (item.quantidade > quantidade)
          flash[:notice] = 'Lembre-se que remover ou diminuir a quantidade de um produto gera um evento para Auditoria'
        end
        @pedido.altera_quantidade_produto(produto, quantidade)
      end
      @pedido.save

SELECT * FROM "produtos" WHERE ("produtos"."id" = '4') LIMIT 1
---
  def editar_produto_lista_compras
    produto = Produto.find_by_id(params[:id]) if params[:id]

SELECT * FROM "produtos" WHERE ("produtos"."id" = '8') LIMIT 1
---
  def remover_produto_lista_compras
    produto = Produto.find_by_id(params[:id]) if params[:id]

UPDATE "pedidos" SET "valor_pago_servico" = 0.0, "valor_total" = 0.78, "status" = 'C', "updated_at" = '2009-07-10 21:16:51' WHERE "id" = 5
---
  def descartar_pedido
    begin
      @pedido.cancelar_pedido
      @pedido.save

UPDATE "pedidos" SET "valor_pago_servico" = 0.0, "valor_total" = 15.68, "status" = 'F', "updated_at" = '2009-07-10 19:28:45' WHERE "id" = 4
---
  def finalizar_pedido
    begin
      @pedido.finalizar_pedido
      @pedido.save