app/controllers/produtos_controller.rb

SELECT * FROM "produtos" ORDER BY descricao LIMIT 12 OFFSET 0
SELECT count(*) AS count_all FROM "produtos"
---
  def index
    @produtos = Produto.paginate(:all, :order => "descricao", :page => params[:page])

SELECT * FROM "produtos" WHERE (descricao like 'p%') ORDER BY descricao LIMIT 12 OFFSET 0
---
  def por_letra
    @produtos = Produto.paginate(:all, :conditions => "descricao like '#{params[:letra]}%'", :order => "descricao", :page => params[:page])

SELECT * FROM "produtos" WHERE (descricao like 'l%') ORDER BY descricao
SELECT * FROM "produtos" WHERE (descricao like 'Cerveja Original%') ORDER BY descricao LIMIT 12 OFFSET 0
---
  def por_descricao
    if (params[:produto] && params[:produto][:descricao]) then
      @produtos = Produto.find(:all, :conditions => "descricao like '#{params[:produto][:descricao]}%'", :order => "descricao")
      render :layout=>false
    else
      @produtos = Produto.paginate(:all, :conditions => "descricao like '#{params[:descricao]}%'", :order => "descricao", :page => params[:page])

SELECT * FROM "produtos" WHERE ("produtos"."id" = 8)
---
  def show
    @produto = Produto.find(params[:id])

SELECT * FROM "produtos" WHERE ("produtos"."id" = 8)
---
  def edit
    @produto = Produto.find(params[:id])

SELECT * FROM "produtos" WHERE ("produtos"."id" = 8)
UPDATE "produtos" SET "valor_venda" = 5.0, "updated_at" = '2009-07-10 21:52:55' WHERE "id" = 20
---
  def update
    @produto = Produto.find(params[:id])

    respond_to do |format|
      if @produto.update_attributes(params[:produto])