app/controllers/usuarios_controller.rb

    def edit
      @usuario = Usuario.find(params[:id])
---
SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 1)

    def create
      @usuario = Usuario.new(params[:usuario])

      respond_to do |format|
        if @usuario.save
---
INSERT INTO "usuarios" ("salt", "updated_at", "hashed_password", "nome", "created_at") VALUES('174117900.845277093608773', '2009-08-26 03:15:33', '4f8fb5c554a4216046eb6b460c5e02f7a34a633b', 'juliana', '2009-08-26 03:15:33')